###################################################################

# Created by write_sdc on Fri Apr  5 13:05:22 2024

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current uA
set_max_capacitance 2 [current_design]
set_max_transition 0.2 [current_design]
set_load -pin_load 1 [get_ports clk]
set_load -pin_load 1 [get_ports rst]
set_load -pin_load 1 [get_ports {if_icache_req_addr[11]}]
set_load -pin_load 1 [get_ports {if_icache_req_addr[10]}]
set_load -pin_load 1 [get_ports {if_icache_req_addr[9]}]
set_load -pin_load 1 [get_ports {if_icache_req_addr[8]}]
set_load -pin_load 1 [get_ports {if_icache_req_addr[7]}]
set_load -pin_load 1 [get_ports {if_icache_req_addr[6]}]
set_load -pin_load 1 [get_ports {if_icache_req_addr[5]}]
set_load -pin_load 1 [get_ports {if_icache_req_addr[4]}]
set_load -pin_load 1 [get_ports {if_icache_req_addr[3]}]
set_load -pin_load 1 [get_ports {if_icache_req_addr[2]}]
set_load -pin_load 1 [get_ports {if_icache_req_addr[1]}]
set_load -pin_load 1 [get_ports {if_icache_req_addr[0]}]
set_load -pin_load 1 [get_ports if_icache_req_valid]
set_load -pin_load 1 [get_ports if_icache_req_rw]
set_load -pin_load 1 [get_ports cpu_jump]
set_load -pin_load 1 [get_ports {if_icache_data_read[31]}]
set_load -pin_load 1 [get_ports {if_icache_data_read[30]}]
set_load -pin_load 1 [get_ports {if_icache_data_read[29]}]
set_load -pin_load 1 [get_ports {if_icache_data_read[28]}]
set_load -pin_load 1 [get_ports {if_icache_data_read[27]}]
set_load -pin_load 1 [get_ports {if_icache_data_read[26]}]
set_load -pin_load 1 [get_ports {if_icache_data_read[25]}]
set_load -pin_load 1 [get_ports {if_icache_data_read[24]}]
set_load -pin_load 1 [get_ports {if_icache_data_read[23]}]
set_load -pin_load 1 [get_ports {if_icache_data_read[22]}]
set_load -pin_load 1 [get_ports {if_icache_data_read[21]}]
set_load -pin_load 1 [get_ports {if_icache_data_read[20]}]
set_load -pin_load 1 [get_ports {if_icache_data_read[19]}]
set_load -pin_load 1 [get_ports {if_icache_data_read[18]}]
set_load -pin_load 1 [get_ports {if_icache_data_read[17]}]
set_load -pin_load 1 [get_ports {if_icache_data_read[16]}]
set_load -pin_load 1 [get_ports {if_icache_data_read[15]}]
set_load -pin_load 1 [get_ports {if_icache_data_read[14]}]
set_load -pin_load 1 [get_ports {if_icache_data_read[13]}]
set_load -pin_load 1 [get_ports {if_icache_data_read[12]}]
set_load -pin_load 1 [get_ports {if_icache_data_read[11]}]
set_load -pin_load 1 [get_ports {if_icache_data_read[10]}]
set_load -pin_load 1 [get_ports {if_icache_data_read[9]}]
set_load -pin_load 1 [get_ports {if_icache_data_read[8]}]
set_load -pin_load 1 [get_ports {if_icache_data_read[7]}]
set_load -pin_load 1 [get_ports {if_icache_data_read[6]}]
set_load -pin_load 1 [get_ports {if_icache_data_read[5]}]
set_load -pin_load 1 [get_ports {if_icache_data_read[4]}]
set_load -pin_load 1 [get_ports {if_icache_data_read[3]}]
set_load -pin_load 1 [get_ports {if_icache_data_read[2]}]
set_load -pin_load 1 [get_ports {if_icache_data_read[1]}]
set_load -pin_load 1 [get_ports {if_icache_data_read[0]}]
set_load -pin_load 1 [get_ports if_icache_ready]
set_load -pin_load 1 [get_ports if_icache_hit]
set_load -pin_load 1 [get_ports {mem_dcache_req_addr[11]}]
set_load -pin_load 1 [get_ports {mem_dcache_req_addr[10]}]
set_load -pin_load 1 [get_ports {mem_dcache_req_addr[9]}]
set_load -pin_load 1 [get_ports {mem_dcache_req_addr[8]}]
set_load -pin_load 1 [get_ports {mem_dcache_req_addr[7]}]
set_load -pin_load 1 [get_ports {mem_dcache_req_addr[6]}]
set_load -pin_load 1 [get_ports {mem_dcache_req_addr[5]}]
set_load -pin_load 1 [get_ports {mem_dcache_req_addr[4]}]
set_load -pin_load 1 [get_ports {mem_dcache_req_addr[3]}]
set_load -pin_load 1 [get_ports {mem_dcache_req_addr[2]}]
set_load -pin_load 1 [get_ports {mem_dcache_req_addr[1]}]
set_load -pin_load 1 [get_ports {mem_dcache_req_addr[0]}]
set_load -pin_load 1 [get_ports mem_dcache_req_valid]
set_load -pin_load 1 [get_ports mem_dcache_req_rw]
set_load -pin_load 1 [get_ports {mem_dcache_data_write[63]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_write[62]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_write[61]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_write[60]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_write[59]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_write[58]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_write[57]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_write[56]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_write[55]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_write[54]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_write[53]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_write[52]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_write[51]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_write[50]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_write[49]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_write[48]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_write[47]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_write[46]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_write[45]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_write[44]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_write[43]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_write[42]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_write[41]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_write[40]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_write[39]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_write[38]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_write[37]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_write[36]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_write[35]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_write[34]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_write[33]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_write[32]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_write[31]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_write[30]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_write[29]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_write[28]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_write[27]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_write[26]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_write[25]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_write[24]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_write[23]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_write[22]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_write[21]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_write[20]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_write[19]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_write[18]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_write[17]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_write[16]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_write[15]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_write[14]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_write[13]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_write[12]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_write[11]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_write[10]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_write[9]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_write[8]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_write[7]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_write[6]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_write[5]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_write[4]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_write[3]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_write[2]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_write[1]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_write[0]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_read[63]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_read[62]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_read[61]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_read[60]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_read[59]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_read[58]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_read[57]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_read[56]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_read[55]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_read[54]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_read[53]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_read[52]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_read[51]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_read[50]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_read[49]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_read[48]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_read[47]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_read[46]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_read[45]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_read[44]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_read[43]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_read[42]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_read[41]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_read[40]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_read[39]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_read[38]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_read[37]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_read[36]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_read[35]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_read[34]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_read[33]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_read[32]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_read[31]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_read[30]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_read[29]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_read[28]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_read[27]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_read[26]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_read[25]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_read[24]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_read[23]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_read[22]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_read[21]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_read[20]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_read[19]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_read[18]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_read[17]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_read[16]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_read[15]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_read[14]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_read[13]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_read[12]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_read[11]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_read[10]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_read[9]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_read[8]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_read[7]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_read[6]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_read[5]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_read[4]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_read[3]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_read[2]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_read[1]}]
set_load -pin_load 1 [get_ports {mem_dcache_data_read[0]}]
set_load -pin_load 1 [get_ports mem_dcache_ready]
set_load -pin_load 1 [get_ports mem_dcache_hit]
set_load -min -pin_load 0.5 [get_ports clk]
set_load -min -pin_load 0.5 [get_ports rst]
set_load -min -pin_load 0.5 [get_ports {if_icache_req_addr[11]}]
set_load -min -pin_load 0.5 [get_ports {if_icache_req_addr[10]}]
set_load -min -pin_load 0.5 [get_ports {if_icache_req_addr[9]}]
set_load -min -pin_load 0.5 [get_ports {if_icache_req_addr[8]}]
set_load -min -pin_load 0.5 [get_ports {if_icache_req_addr[7]}]
set_load -min -pin_load 0.5 [get_ports {if_icache_req_addr[6]}]
set_load -min -pin_load 0.5 [get_ports {if_icache_req_addr[5]}]
set_load -min -pin_load 0.5 [get_ports {if_icache_req_addr[4]}]
set_load -min -pin_load 0.5 [get_ports {if_icache_req_addr[3]}]
set_load -min -pin_load 0.5 [get_ports {if_icache_req_addr[2]}]
set_load -min -pin_load 0.5 [get_ports {if_icache_req_addr[1]}]
set_load -min -pin_load 0.5 [get_ports {if_icache_req_addr[0]}]
set_load -min -pin_load 0.5 [get_ports if_icache_req_valid]
set_load -min -pin_load 0.5 [get_ports if_icache_req_rw]
set_load -min -pin_load 0.5 [get_ports cpu_jump]
set_load -min -pin_load 0.5 [get_ports {if_icache_data_read[31]}]
set_load -min -pin_load 0.5 [get_ports {if_icache_data_read[30]}]
set_load -min -pin_load 0.5 [get_ports {if_icache_data_read[29]}]
set_load -min -pin_load 0.5 [get_ports {if_icache_data_read[28]}]
set_load -min -pin_load 0.5 [get_ports {if_icache_data_read[27]}]
set_load -min -pin_load 0.5 [get_ports {if_icache_data_read[26]}]
set_load -min -pin_load 0.5 [get_ports {if_icache_data_read[25]}]
set_load -min -pin_load 0.5 [get_ports {if_icache_data_read[24]}]
set_load -min -pin_load 0.5 [get_ports {if_icache_data_read[23]}]
set_load -min -pin_load 0.5 [get_ports {if_icache_data_read[22]}]
set_load -min -pin_load 0.5 [get_ports {if_icache_data_read[21]}]
set_load -min -pin_load 0.5 [get_ports {if_icache_data_read[20]}]
set_load -min -pin_load 0.5 [get_ports {if_icache_data_read[19]}]
set_load -min -pin_load 0.5 [get_ports {if_icache_data_read[18]}]
set_load -min -pin_load 0.5 [get_ports {if_icache_data_read[17]}]
set_load -min -pin_load 0.5 [get_ports {if_icache_data_read[16]}]
set_load -min -pin_load 0.5 [get_ports {if_icache_data_read[15]}]
set_load -min -pin_load 0.5 [get_ports {if_icache_data_read[14]}]
set_load -min -pin_load 0.5 [get_ports {if_icache_data_read[13]}]
set_load -min -pin_load 0.5 [get_ports {if_icache_data_read[12]}]
set_load -min -pin_load 0.5 [get_ports {if_icache_data_read[11]}]
set_load -min -pin_load 0.5 [get_ports {if_icache_data_read[10]}]
set_load -min -pin_load 0.5 [get_ports {if_icache_data_read[9]}]
set_load -min -pin_load 0.5 [get_ports {if_icache_data_read[8]}]
set_load -min -pin_load 0.5 [get_ports {if_icache_data_read[7]}]
set_load -min -pin_load 0.5 [get_ports {if_icache_data_read[6]}]
set_load -min -pin_load 0.5 [get_ports {if_icache_data_read[5]}]
set_load -min -pin_load 0.5 [get_ports {if_icache_data_read[4]}]
set_load -min -pin_load 0.5 [get_ports {if_icache_data_read[3]}]
set_load -min -pin_load 0.5 [get_ports {if_icache_data_read[2]}]
set_load -min -pin_load 0.5 [get_ports {if_icache_data_read[1]}]
set_load -min -pin_load 0.5 [get_ports {if_icache_data_read[0]}]
set_load -min -pin_load 0.5 [get_ports if_icache_ready]
set_load -min -pin_load 0.5 [get_ports if_icache_hit]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_req_addr[11]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_req_addr[10]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_req_addr[9]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_req_addr[8]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_req_addr[7]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_req_addr[6]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_req_addr[5]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_req_addr[4]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_req_addr[3]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_req_addr[2]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_req_addr[1]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_req_addr[0]}]
set_load -min -pin_load 0.5 [get_ports mem_dcache_req_valid]
set_load -min -pin_load 0.5 [get_ports mem_dcache_req_rw]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_write[63]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_write[62]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_write[61]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_write[60]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_write[59]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_write[58]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_write[57]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_write[56]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_write[55]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_write[54]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_write[53]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_write[52]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_write[51]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_write[50]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_write[49]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_write[48]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_write[47]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_write[46]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_write[45]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_write[44]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_write[43]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_write[42]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_write[41]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_write[40]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_write[39]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_write[38]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_write[37]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_write[36]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_write[35]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_write[34]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_write[33]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_write[32]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_write[31]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_write[30]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_write[29]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_write[28]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_write[27]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_write[26]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_write[25]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_write[24]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_write[23]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_write[22]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_write[21]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_write[20]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_write[19]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_write[18]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_write[17]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_write[16]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_write[15]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_write[14]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_write[13]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_write[12]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_write[11]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_write[10]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_write[9]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_write[8]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_write[7]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_write[6]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_write[5]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_write[4]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_write[3]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_write[2]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_write[1]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_write[0]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_read[63]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_read[62]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_read[61]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_read[60]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_read[59]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_read[58]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_read[57]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_read[56]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_read[55]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_read[54]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_read[53]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_read[52]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_read[51]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_read[50]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_read[49]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_read[48]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_read[47]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_read[46]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_read[45]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_read[44]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_read[43]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_read[42]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_read[41]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_read[40]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_read[39]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_read[38]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_read[37]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_read[36]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_read[35]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_read[34]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_read[33]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_read[32]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_read[31]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_read[30]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_read[29]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_read[28]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_read[27]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_read[26]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_read[25]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_read[24]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_read[23]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_read[22]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_read[21]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_read[20]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_read[19]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_read[18]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_read[17]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_read[16]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_read[15]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_read[14]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_read[13]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_read[12]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_read[11]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_read[10]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_read[9]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_read[8]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_read[7]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_read[6]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_read[5]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_read[4]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_read[3]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_read[2]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_read[1]}]
set_load -min -pin_load 0.5 [get_ports {mem_dcache_data_read[0]}]
set_load -min -pin_load 0.5 [get_ports mem_dcache_ready]
set_load -min -pin_load 0.5 [get_ports mem_dcache_hit]
create_clock [get_ports clk]  -period 5  -waveform {0 2.5}
set_clock_uncertainty -setup 0.25  [get_clocks clk]
set_clock_uncertainty -hold 0.15  [get_clocks clk]
set_input_delay -clock clk  1.5  [get_ports rst]
set_input_delay -clock clk  1.5  [get_ports {if_icache_data_read[31]}]
set_input_delay -clock clk  1.5  [get_ports {if_icache_data_read[30]}]
set_input_delay -clock clk  1.5  [get_ports {if_icache_data_read[29]}]
set_input_delay -clock clk  1.5  [get_ports {if_icache_data_read[28]}]
set_input_delay -clock clk  1.5  [get_ports {if_icache_data_read[27]}]
set_input_delay -clock clk  1.5  [get_ports {if_icache_data_read[26]}]
set_input_delay -clock clk  1.5  [get_ports {if_icache_data_read[25]}]
set_input_delay -clock clk  1.5  [get_ports {if_icache_data_read[24]}]
set_input_delay -clock clk  1.5  [get_ports {if_icache_data_read[23]}]
set_input_delay -clock clk  1.5  [get_ports {if_icache_data_read[22]}]
set_input_delay -clock clk  1.5  [get_ports {if_icache_data_read[21]}]
set_input_delay -clock clk  1.5  [get_ports {if_icache_data_read[20]}]
set_input_delay -clock clk  1.5  [get_ports {if_icache_data_read[19]}]
set_input_delay -clock clk  1.5  [get_ports {if_icache_data_read[18]}]
set_input_delay -clock clk  1.5  [get_ports {if_icache_data_read[17]}]
set_input_delay -clock clk  1.5  [get_ports {if_icache_data_read[16]}]
set_input_delay -clock clk  1.5  [get_ports {if_icache_data_read[15]}]
set_input_delay -clock clk  1.5  [get_ports {if_icache_data_read[14]}]
set_input_delay -clock clk  1.5  [get_ports {if_icache_data_read[13]}]
set_input_delay -clock clk  1.5  [get_ports {if_icache_data_read[12]}]
set_input_delay -clock clk  1.5  [get_ports {if_icache_data_read[11]}]
set_input_delay -clock clk  1.5  [get_ports {if_icache_data_read[10]}]
set_input_delay -clock clk  1.5  [get_ports {if_icache_data_read[9]}]
set_input_delay -clock clk  1.5  [get_ports {if_icache_data_read[8]}]
set_input_delay -clock clk  1.5  [get_ports {if_icache_data_read[7]}]
set_input_delay -clock clk  1.5  [get_ports {if_icache_data_read[6]}]
set_input_delay -clock clk  1.5  [get_ports {if_icache_data_read[5]}]
set_input_delay -clock clk  1.5  [get_ports {if_icache_data_read[4]}]
set_input_delay -clock clk  1.5  [get_ports {if_icache_data_read[3]}]
set_input_delay -clock clk  1.5  [get_ports {if_icache_data_read[2]}]
set_input_delay -clock clk  1.5  [get_ports {if_icache_data_read[1]}]
set_input_delay -clock clk  1.5  [get_ports {if_icache_data_read[0]}]
set_input_delay -clock clk  1.5  [get_ports if_icache_ready]
set_input_delay -clock clk  1.5  [get_ports if_icache_hit]
set_input_delay -clock clk  1.5  [get_ports {mem_dcache_data_read[63]}]
set_input_delay -clock clk  1.5  [get_ports {mem_dcache_data_read[62]}]
set_input_delay -clock clk  1.5  [get_ports {mem_dcache_data_read[61]}]
set_input_delay -clock clk  1.5  [get_ports {mem_dcache_data_read[60]}]
set_input_delay -clock clk  1.5  [get_ports {mem_dcache_data_read[59]}]
set_input_delay -clock clk  1.5  [get_ports {mem_dcache_data_read[58]}]
set_input_delay -clock clk  1.5  [get_ports {mem_dcache_data_read[57]}]
set_input_delay -clock clk  1.5  [get_ports {mem_dcache_data_read[56]}]
set_input_delay -clock clk  1.5  [get_ports {mem_dcache_data_read[55]}]
set_input_delay -clock clk  1.5  [get_ports {mem_dcache_data_read[54]}]
set_input_delay -clock clk  1.5  [get_ports {mem_dcache_data_read[53]}]
set_input_delay -clock clk  1.5  [get_ports {mem_dcache_data_read[52]}]
set_input_delay -clock clk  1.5  [get_ports {mem_dcache_data_read[51]}]
set_input_delay -clock clk  1.5  [get_ports {mem_dcache_data_read[50]}]
set_input_delay -clock clk  1.5  [get_ports {mem_dcache_data_read[49]}]
set_input_delay -clock clk  1.5  [get_ports {mem_dcache_data_read[48]}]
set_input_delay -clock clk  1.5  [get_ports {mem_dcache_data_read[47]}]
set_input_delay -clock clk  1.5  [get_ports {mem_dcache_data_read[46]}]
set_input_delay -clock clk  1.5  [get_ports {mem_dcache_data_read[45]}]
set_input_delay -clock clk  1.5  [get_ports {mem_dcache_data_read[44]}]
set_input_delay -clock clk  1.5  [get_ports {mem_dcache_data_read[43]}]
set_input_delay -clock clk  1.5  [get_ports {mem_dcache_data_read[42]}]
set_input_delay -clock clk  1.5  [get_ports {mem_dcache_data_read[41]}]
set_input_delay -clock clk  1.5  [get_ports {mem_dcache_data_read[40]}]
set_input_delay -clock clk  1.5  [get_ports {mem_dcache_data_read[39]}]
set_input_delay -clock clk  1.5  [get_ports {mem_dcache_data_read[38]}]
set_input_delay -clock clk  1.5  [get_ports {mem_dcache_data_read[37]}]
set_input_delay -clock clk  1.5  [get_ports {mem_dcache_data_read[36]}]
set_input_delay -clock clk  1.5  [get_ports {mem_dcache_data_read[35]}]
set_input_delay -clock clk  1.5  [get_ports {mem_dcache_data_read[34]}]
set_input_delay -clock clk  1.5  [get_ports {mem_dcache_data_read[33]}]
set_input_delay -clock clk  1.5  [get_ports {mem_dcache_data_read[32]}]
set_input_delay -clock clk  1.5  [get_ports {mem_dcache_data_read[31]}]
set_input_delay -clock clk  1.5  [get_ports {mem_dcache_data_read[30]}]
set_input_delay -clock clk  1.5  [get_ports {mem_dcache_data_read[29]}]
set_input_delay -clock clk  1.5  [get_ports {mem_dcache_data_read[28]}]
set_input_delay -clock clk  1.5  [get_ports {mem_dcache_data_read[27]}]
set_input_delay -clock clk  1.5  [get_ports {mem_dcache_data_read[26]}]
set_input_delay -clock clk  1.5  [get_ports {mem_dcache_data_read[25]}]
set_input_delay -clock clk  1.5  [get_ports {mem_dcache_data_read[24]}]
set_input_delay -clock clk  1.5  [get_ports {mem_dcache_data_read[23]}]
set_input_delay -clock clk  1.5  [get_ports {mem_dcache_data_read[22]}]
set_input_delay -clock clk  1.5  [get_ports {mem_dcache_data_read[21]}]
set_input_delay -clock clk  1.5  [get_ports {mem_dcache_data_read[20]}]
set_input_delay -clock clk  1.5  [get_ports {mem_dcache_data_read[19]}]
set_input_delay -clock clk  1.5  [get_ports {mem_dcache_data_read[18]}]
set_input_delay -clock clk  1.5  [get_ports {mem_dcache_data_read[17]}]
set_input_delay -clock clk  1.5  [get_ports {mem_dcache_data_read[16]}]
set_input_delay -clock clk  1.5  [get_ports {mem_dcache_data_read[15]}]
set_input_delay -clock clk  1.5  [get_ports {mem_dcache_data_read[14]}]
set_input_delay -clock clk  1.5  [get_ports {mem_dcache_data_read[13]}]
set_input_delay -clock clk  1.5  [get_ports {mem_dcache_data_read[12]}]
set_input_delay -clock clk  1.5  [get_ports {mem_dcache_data_read[11]}]
set_input_delay -clock clk  1.5  [get_ports {mem_dcache_data_read[10]}]
set_input_delay -clock clk  1.5  [get_ports {mem_dcache_data_read[9]}]
set_input_delay -clock clk  1.5  [get_ports {mem_dcache_data_read[8]}]
set_input_delay -clock clk  1.5  [get_ports {mem_dcache_data_read[7]}]
set_input_delay -clock clk  1.5  [get_ports {mem_dcache_data_read[6]}]
set_input_delay -clock clk  1.5  [get_ports {mem_dcache_data_read[5]}]
set_input_delay -clock clk  1.5  [get_ports {mem_dcache_data_read[4]}]
set_input_delay -clock clk  1.5  [get_ports {mem_dcache_data_read[3]}]
set_input_delay -clock clk  1.5  [get_ports {mem_dcache_data_read[2]}]
set_input_delay -clock clk  1.5  [get_ports {mem_dcache_data_read[1]}]
set_input_delay -clock clk  1.5  [get_ports {mem_dcache_data_read[0]}]
set_input_delay -clock clk  1.5  [get_ports mem_dcache_ready]
set_input_delay -clock clk  1.5  [get_ports mem_dcache_hit]
set_output_delay -clock clk  0.75  [get_ports {if_icache_req_addr[11]}]
set_output_delay -clock clk  0.75  [get_ports {if_icache_req_addr[10]}]
set_output_delay -clock clk  0.75  [get_ports {if_icache_req_addr[9]}]
set_output_delay -clock clk  0.75  [get_ports {if_icache_req_addr[8]}]
set_output_delay -clock clk  0.75  [get_ports {if_icache_req_addr[7]}]
set_output_delay -clock clk  0.75  [get_ports {if_icache_req_addr[6]}]
set_output_delay -clock clk  0.75  [get_ports {if_icache_req_addr[5]}]
set_output_delay -clock clk  0.75  [get_ports {if_icache_req_addr[4]}]
set_output_delay -clock clk  0.75  [get_ports {if_icache_req_addr[3]}]
set_output_delay -clock clk  0.75  [get_ports {if_icache_req_addr[2]}]
set_output_delay -clock clk  0.75  [get_ports {if_icache_req_addr[1]}]
set_output_delay -clock clk  0.75  [get_ports {if_icache_req_addr[0]}]
set_output_delay -clock clk  0.75  [get_ports if_icache_req_valid]
set_output_delay -clock clk  0.75  [get_ports if_icache_req_rw]
set_output_delay -clock clk  0.75  [get_ports cpu_jump]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_req_addr[11]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_req_addr[10]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_req_addr[9]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_req_addr[8]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_req_addr[7]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_req_addr[6]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_req_addr[5]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_req_addr[4]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_req_addr[3]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_req_addr[2]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_req_addr[1]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_req_addr[0]}]
set_output_delay -clock clk  0.75  [get_ports mem_dcache_req_valid]
set_output_delay -clock clk  0.75  [get_ports mem_dcache_req_rw]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_data_write[63]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_data_write[62]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_data_write[61]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_data_write[60]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_data_write[59]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_data_write[58]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_data_write[57]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_data_write[56]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_data_write[55]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_data_write[54]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_data_write[53]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_data_write[52]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_data_write[51]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_data_write[50]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_data_write[49]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_data_write[48]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_data_write[47]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_data_write[46]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_data_write[45]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_data_write[44]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_data_write[43]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_data_write[42]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_data_write[41]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_data_write[40]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_data_write[39]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_data_write[38]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_data_write[37]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_data_write[36]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_data_write[35]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_data_write[34]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_data_write[33]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_data_write[32]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_data_write[31]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_data_write[30]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_data_write[29]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_data_write[28]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_data_write[27]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_data_write[26]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_data_write[25]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_data_write[24]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_data_write[23]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_data_write[22]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_data_write[21]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_data_write[20]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_data_write[19]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_data_write[18]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_data_write[17]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_data_write[16]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_data_write[15]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_data_write[14]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_data_write[13]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_data_write[12]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_data_write[11]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_data_write[10]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_data_write[9]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_data_write[8]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_data_write[7]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_data_write[6]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_data_write[5]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_data_write[4]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_data_write[3]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_data_write[2]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_data_write[1]}]
set_output_delay -clock clk  0.75  [get_ports {mem_dcache_data_write[0]}]
